cf/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ИнформационныеБазы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьWS(Команда)
	Сообщить(ВыполнитьПодключение(Элементы.Список.ТекущиеДанные.Ссылка));
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ВыполнитьПодключение(ИБ)
	
	// Подключение
		Попытка
			Определения = Новый WSОпределения(ИБ.WSСсылка, ИБ.WSПользователь, ИБ.WSПароль);
			ЗаписьЖурналаРегистрации("Обмен данными XML. Успех при создании WSОпределения.",,,,"База: "+ИБ+".");
			ТекстСообщения = "WSОпределение создано";
		Исключение
			ЗаписьЖурналаРегистрации("Обмен данными XML. Ошибка при создании WSОпределения.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = "Ошибка при создании WSОпределения";
		КонецПопытки; 
		
		Попытка
			Прокси = Новый WSПрокси(Определения, "http://www.rusalco.com/xtdo", "WebRusAlco", "WebRusAlcoSoap");
			Прокси.Пользователь = ИБ.WSПользователь;
			Прокси.Пароль = ИБ.WSПароль;
			ЗаписьЖурналаРегистрации("Обмен данными XML. Успех при создании WSПрокси.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = ТекстСообщения+"; WSПрокси создано";
		Исключение
			ЗаписьЖурналаРегистрации("Обмен данными XML. Ошибка при создании WSПрокси.",,,,"База: "+ИБ+". "+ОписаниеОшибки());
			ТекстСообщения = ТекстСообщения+"; Ошибка при создании WSПрокси";
		КонецПопытки;
		Возврат ТекстСообщения;
		
КонецФункции // ВыполнитьПодключение()
